Listlar bilan ishlash

In [1]:
a=[1,2,3,4,5,6,7]

In [4]:
a.pop()

7

In [7]:
a.append(98)
print(a)

[1, 2, 3, 4, 5, 6, 98, 98, 98]

In [8]:
a.insert(4,88)

In [9]:
print(a)

[1, 2, 3, 4, 88, 5, 6, 98, 98, 98]

#Conditions exercises

In [1]:
a=5 
if a>0:
    print('a musbat son')

a musbat son

In [5]:
a=-9
if a>0:
    print('musbat'),
else:
    print('manfiy')

manfiy

In [8]:
a=0
if a>0:
    print('musbat'),
elif a<0:
    print('manfiy'),
else:
    print('a nolga teng')

a nolga teng

In [11]:
a=int(input('istalgan son'))
if a>0:
    print('musbat'),
elif a<0:
    print('manfiy'),
else:
    print('a nolga teng')

manfiy

In [13]:
for i in range(1,11):
    print(i)

1
2
3
4
5
6
7
8
9
10

In [14]:
for i in range (1,11,3):
    print(i)

1
4
7
10

In [21]:
for i in range (1,21):
    if i%2==0:
        print(i)

2
4
6
8
10
12
14
16
18
20

#2-part

In [1]:
import pandas as pd
import numpy as nd 
import seaborn as sns

In [15]:
import klib

In [2]:
df=pd.read_csv('application_record.csv.zip')

In [3]:
df.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  object
 2   FLAG_OWN_CAR         438557 non-null  object
 3   FLAG_OWN_REALTY      438557 non-null  object
 4   CNT_CHILDREN         438557 non-null  int64
 5   AMT_INCOME_TOTAL     438557 non-null  float64
 6   NAME_INCOME_TYPE     438557 non-null  object
 7   NAME_EDUCATION_TYPE  438557 non-null  object
 8   NAME_FAMILY_STATUS   438557 non-null  object
 9   NAME_HOUSING_TYPE    438557 non-null  object
 10  DAYS_BIRTH           438557 non-null  int64
 11  DAYS_EMPLOYED        438557 non-null  int64
 12  FLAG_MOBIL           438557 non-null  int64
 13  FLAG_WORK_PHONE      438557 non-null  int64
 14  FLAG_PHONE           438557 non-null  int64
 15  FLAG_EMAIL           438557 non-null  int64
 16  OCCUPATION_TYPE      304354 non-null  object
 17  CNT_FAM_MEMBERS      438557 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB

In [5]:
df['OCCUPATION_TYPE']

0                    NaN
1                    NaN
2         Security staff
3            Sales staff
4            Sales staff
               ...
438552               NaN
438553          Laborers
438554       Sales staff
438555               NaN
438556       Sales staff
Name: OCCUPATION_TYPE, Length: 438557, dtype: object

In [6]:
df.fillna(df['OCCUPATION_TYPE'].mode() [0], inplace=True)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  object
 2   FLAG_OWN_CAR         438557 non-null  object
 3   FLAG_OWN_REALTY      438557 non-null  object
 4   CNT_CHILDREN         438557 non-null  int64
 5   AMT_INCOME_TOTAL     438557 non-null  float64
 6   NAME_INCOME_TYPE     438557 non-null  object
 7   NAME_EDUCATION_TYPE  438557 non-null  object
 8   NAME_FAMILY_STATUS   438557 non-null  object
 9   NAME_HOUSING_TYPE    438557 non-null  object
 10  DAYS_BIRTH           438557 non-null  int64
 11  DAYS_EMPLOYED        438557 non-null  int64
 12  FLAG_MOBIL           438557 non-null  int64
 13  FLAG_WORK_PHONE      438557 non-null  int64
 14  FLAG_PHONE           438557 non-null  int64
 15  FLAG_EMAIL           438557 non-null  int64
 16  OCCUPATION_TYPE      438557 non-null  object
 17  CNT_FAM_MEMBERS      438557 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB

#encoding

In [8]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder

In [10]:
df['CODE_GENDER'].value_counts()

F    294440
M    144117
Name: CODE_GENDER, dtype: int64

In [11]:
df['OCCUPATION_TYPE'].value_counts()

Laborers                 212443
Core staff                43007
Sales staff               41098
Managers                  35487
Drivers                   26090
High skill tech staff     17289
Accountants               15985
Medicine staff            13520
Cooking staff              8076
Security staff             7993
Cleaning staff             5845
Private service staff      3456
Low-skill Laborers         2140
Secretaries                2044
Waiters/barmen staff       1665
Realty agents              1041
HR staff                    774
IT staff                    604
Name: OCCUPATION_TYPE, dtype: int64

In [12]:
cardinality=df.nunique()

In [13]:
cardinality

ID                     438510
CODE_GENDER                 2
FLAG_OWN_CAR                2
FLAG_OWN_REALTY             2
CNT_CHILDREN               12
AMT_INCOME_TOTAL          866
NAME_INCOME_TYPE            5
NAME_EDUCATION_TYPE         5
NAME_FAMILY_STATUS          5
NAME_HOUSING_TYPE           6
DAYS_BIRTH              16379
DAYS_EMPLOYED            9406
FLAG_MOBIL                  1
FLAG_WORK_PHONE             2
FLAG_PHONE                  2
FLAG_EMAIL                  2
OCCUPATION_TYPE            18
CNT_FAM_MEMBERS            13
dtype: int64

In [14]:
for col in df.columns:
    if df[col].dtype == 'object':
        if cardinality[col] <= 5:
            df = pd.get_dummies(df, columns=[col], dtype=int, drop_first=True)
        else:
            le = LabelEncoder()
            df[col] = le.fit_transform(df[col])

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 27 columns):
 #   Column                                             Non-Null Count   Dtype
---  ------                                             --------------   -----
 0   ID                                                 438557 non-null  int64
 1   CNT_CHILDREN                                       438557 non-null  int64
 2   AMT_INCOME_TOTAL                                   438557 non-null  float64
 3   NAME_HOUSING_TYPE                                  438557 non-null  int32
 4   DAYS_BIRTH                                         438557 non-null  int64
 5   DAYS_EMPLOYED                                      438557 non-null  int64
 6   FLAG_MOBIL                                         438557 non-null  int64
 7   FLAG_WORK_PHONE                                    438557 non-null  int64
 8   FLAG_PHONE                                         438557 non-null  int64
 9   FLAG_EMAIL                                         438557 non-null  int64
 10  OCCUPATION_TYPE                                    438557 non-null  int32
 11  CNT_FAM_MEMBERS                                    438557 non-null  float64
 12  CODE_GENDER_M                                      438557 non-null  int32
 13  FLAG_OWN_CAR_Y                                     438557 non-null  int32
 14  FLAG_OWN_REALTY_Y                                  438557 non-null  int32
 15  NAME_INCOME_TYPE_Pensioner                         438557 non-null  int32
 16  NAME_INCOME_TYPE_State servant                     438557 non-null  int32
 17  NAME_INCOME_TYPE_Student                           438557 non-null  int32
 18  NAME_INCOME_TYPE_Working                           438557 non-null  int32
 19  NAME_EDUCATION_TYPE_Higher education               438557 non-null  int32
 20  NAME_EDUCATION_TYPE_Incomplete higher              438557 non-null  int32
 21  NAME_EDUCATION_TYPE_Lower secondary                438557 non-null  int32
 22  NAME_EDUCATION_TYPE_Secondary / secondary special  438557 non-null  int32
 23  NAME_FAMILY_STATUS_Married                         438557 non-null  int32
 24  NAME_FAMILY_STATUS_Separated                       438557 non-null  int32
 25  NAME_FAMILY_STATUS_Single / not married            438557 non-null  int32
 26  NAME_FAMILY_STATUS_Widow                           438557 non-null  int32
dtypes: float64(2), int32(17), int64(8)
memory usage: 61.9 MB

In [16]:
df.head()

,ID,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,...,NAME_INCOME_TYPE_Student,NAME_INCOME_TYPE_Working,NAME_EDUCATION_TYPE_Higher education,NAME_EDUCATION_TYPE_Incomplete higher,NAME_EDUCATION_TYPE_Lower secondary,NAME_EDUCATION_TYPE_Secondary / secondary special,NAME_FAMILY_STATUS_Married,NAME_FAMILY_STATUS_Separated,NAME_FAMILY_STATUS_Single / not married,NAME_FAMILY_STATUS_Widow
0,5008804,0,427500.0,4,-12005,-4542,1,1,0,0,...,0,1,1,0,0,0,0,0,0,0
1,5008805,0,427500.0,4,-12005,-4542,1,1,0,0,...,0,1,1,0,0,0,0,0,0,0
2,5008806,0,112500.0,1,-21474,-1134,1,0,0,0,...,0,1,0,0,0,1,1,0,0,0
3,5008808,0,270000.0,1,-19110,-3051,1,0,1,1,...,0,0,0,0,0,1,0,0,1,0
4,5008809,0,270000.0,1,-19110,-3051,1,0,1,1,...,0,0,0,0,0,1,0,0,1,0

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 27 columns):
 #   Column                                             Non-Null Count   Dtype
---  ------                                             --------------   -----
 0   ID                                                 438557 non-null  int64
 1   CNT_CHILDREN                                       438557 non-null  int64
 2   AMT_INCOME_TOTAL                                   438557 non-null  float64
 3   NAME_HOUSING_TYPE                                  438557 non-null  int32
 4   DAYS_BIRTH                                         438557 non-null  int64
 5   DAYS_EMPLOYED                                      438557 non-null  int64
 6   FLAG_MOBIL                                         438557 non-null  int64
 7   FLAG_WORK_PHONE                                    438557 non-null  int64
 8   FLAG_PHONE                                         438557 non-null  int64
 9   FLAG_EMAIL                                         438557 non-null  int64
 10  OCCUPATION_TYPE                                    438557 non-null  int32
 11  CNT_FAM_MEMBERS                                    438557 non-null  float64
 12  CODE_GENDER_M                                      438557 non-null  int32
 13  FLAG_OWN_CAR_Y                                     438557 non-null  int32
 14  FLAG_OWN_REALTY_Y                                  438557 non-null  int32
 15  NAME_INCOME_TYPE_Pensioner                         438557 non-null  int32
 16  NAME_INCOME_TYPE_State servant                     438557 non-null  int32
 17  NAME_INCOME_TYPE_Student                           438557 non-null  int32
 18  NAME_INCOME_TYPE_Working                           438557 non-null  int32
 19  NAME_EDUCATION_TYPE_Higher education               438557 non-null  int32
 20  NAME_EDUCATION_TYPE_Incomplete higher              438557 non-null  int32
 21  NAME_EDUCATION_TYPE_Lower secondary                438557 non-null  int32
 22  NAME_EDUCATION_TYPE_Secondary / secondary special  438557 non-null  int32
 23  NAME_FAMILY_STATUS_Married                         438557 non-null  int32
 24  NAME_FAMILY_STATUS_Separated                       438557 non-null  int32
 25  NAME_FAMILY_STATUS_Single / not married            438557 non-null  int32
 26  NAME_FAMILY_STATUS_Widow                           438557 non-null  int32
dtypes: float64(2), int32(17), int64(8)
memory usage: 61.9 MB

In [ ]:
from sklearn.preprocessing import StandardScaler

In [18]:
num_col=df.select_dtypes(include=['int32','float64']).columns

In [19]:
num_col

Index(['AMT_INCOME_TOTAL', 'NAME_HOUSING_TYPE', 'OCCUPATION_TYPE',
       'CNT_FAM_MEMBERS', 'CODE_GENDER_M', 'FLAG_OWN_CAR_Y',
       'FLAG_OWN_REALTY_Y', 'NAME_INCOME_TYPE_Pensioner',
       'NAME_INCOME_TYPE_State servant', 'NAME_INCOME_TYPE_Student',
       'NAME_INCOME_TYPE_Working', 'NAME_EDUCATION_TYPE_Higher education',
       'NAME_EDUCATION_TYPE_Incomplete higher',
       'NAME_EDUCATION_TYPE_Lower secondary',
       'NAME_EDUCATION_TYPE_Secondary / secondary special',
       'NAME_FAMILY_STATUS_Married', 'NAME_FAMILY_STATUS_Separated',
       'NAME_FAMILY_STATUS_Single / not married', 'NAME_FAMILY_STATUS_Widow'],
      dtype='object')

In [20]:
from sklearn.preprocessing import MinMaxScaler, StandardScaler
import pandas as pd

In [22]:
original_columns=df.columns
original_columns

Index(['ID', 'CNT_CHILDREN', 'AMT_INCOME_TOTAL', 'NAME_HOUSING_TYPE',
       'DAYS_BIRTH', 'DAYS_EMPLOYED', 'FLAG_MOBIL', 'FLAG_WORK_PHONE',
       'FLAG_PHONE', 'FLAG_EMAIL', 'OCCUPATION_TYPE', 'CNT_FAM_MEMBERS',
       'CODE_GENDER_M', 'FLAG_OWN_CAR_Y', 'FLAG_OWN_REALTY_Y',
       'NAME_INCOME_TYPE_Pensioner', 'NAME_INCOME_TYPE_State servant',
       'NAME_INCOME_TYPE_Student', 'NAME_INCOME_TYPE_Working',
       'NAME_EDUCATION_TYPE_Higher education',
       'NAME_EDUCATION_TYPE_Incomplete higher',
       'NAME_EDUCATION_TYPE_Lower secondary',
       'NAME_EDUCATION_TYPE_Secondary / secondary special',
       'NAME_FAMILY_STATUS_Married', 'NAME_FAMILY_STATUS_Separated',
       'NAME_FAMILY_STATUS_Single / not married', 'NAME_FAMILY_STATUS_Widow'],
      dtype='object')

In [23]:
scaler=StandardScaler()
df=scaler.fit_transform(df)
df=pd.DataFrame(df)

In [30]:
df=pd.DataFrame(df,columns=original_columns)
scaler=StandardScaler()
df=scaler.fit_transform(df)

c:\Users\musli\anaconda3\Lib\site-packages\sklearn\utils\extmath.py:1047: RuntimeWarning: invalid value encountered in divide
  updated_mean = (last_sum + new_sum) / updated_sample_count
c:\Users\musli\anaconda3\Lib\site-packages\sklearn\utils\extmath.py:1052: RuntimeWarning: invalid value encountered in divide
  T = new_sum / new_sample_count
c:\Users\musli\anaconda3\Lib\site-packages\sklearn\utils\extmath.py:1072: RuntimeWarning: invalid value encountered in divide
  new_unnormalized_variance -= correction**2 / new_sample_count

In [31]:
df.head()

AttributeError: 'numpy.ndarray' object has no attribute 'head'

In [87]:
num_col

Index(['AMT_INCOME_TOTAL', 'NAME_HOUSING_TYPE', 'OCCUPATION_TYPE',
       'CNT_FAM_MEMBERS', 'CODE_GENDER_M', 'FLAG_OWN_CAR_Y',
       'FLAG_OWN_REALTY_Y', 'NAME_INCOME_TYPE_Pensioner',
       'NAME_INCOME_TYPE_State servant', 'NAME_INCOME_TYPE_Student',
       'NAME_INCOME_TYPE_Working', 'NAME_EDUCATION_TYPE_Higher education',
       'NAME_EDUCATION_TYPE_Incomplete higher',
       'NAME_EDUCATION_TYPE_Lower secondary',
       'NAME_EDUCATION_TYPE_Secondary / secondary special',
       'NAME_FAMILY_STATUS_Married', 'NAME_FAMILY_STATUS_Separated',
       'NAME_FAMILY_STATUS_Single / not married', 'NAME_FAMILY_STATUS_Widow'],
      dtype='object')

In [29]:
df.head()

,ID,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,...,NAME_INCOME_TYPE_Student,NAME_INCOME_TYPE_Working,NAME_EDUCATION_TYPE_Higher education,NAME_EDUCATION_TYPE_Incomplete higher,NAME_EDUCATION_TYPE_Lower secondary,NAME_EDUCATION_TYPE_Secondary / secondary special,NAME_FAMILY_STATUS_Married,NAME_FAMILY_STATUS_Separated,NAME_FAMILY_STATUS_Single / not married,NAME_FAMILY_STATUS_Widow
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [72]:
df_scaled.head()

,0,1,2,3,4,5,6,7,8,9,...,17,18,19,20,21,22,23,24,25,26
0,-1.772757,-0.5896,2.179879,3.020651,0.954093,-0.469170,0.0,1.962458,-0.635644,-0.348334,...,-0.006226,0.969343,1.652786,-0.187217,-0.096557,-1.485707,-1.470119,-0.2574,-0.379741,-0.216726
1,-1.772755,-0.5896,2.179879,3.020651,0.954093,-0.469170,0.0,1.962458,-0.635644,-0.348334,...,-0.006226,0.969343,1.652786,-0.187217,-0.096557,-1.485707,-1.470119,-0.2574,-0.379741,-0.216726
2,-1.772753,-0.5896,-0.681502,-0.288625,-1.308498,-0.444611,0.0,-0.509565,-0.635644,-0.348334,...,-0.006226,0.969343,-0.605039,-0.187217,-0.096557,0.673080,0.680217,-0.2574,-0.379741,-0.216726
3,-1.772750,-0.5896,0.749189,-0.288625,-0.743626,-0.458426,0.0,-0.509565,1.573208,2.870807,...,-0.006226,-1.031627,-0.605039,-0.187217,-0.096557,0.673080,-1.470119,-0.2574,2.633376,-0.216726
4,-1.772748,-0.5896,0.749189,-0.288625,-0.743626,-0.458426,0.0,-0.509565,1.573208,2.870807,...,-0.006226,-1.031627,-0.605039,-0.187217,-0.096557,0.673080,-1.470119,-0.2574,2.633376,-0.216726

In [73]:
df_scaled.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 27 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   0       438557 non-null  float64
 1   1       438557 non-null  float64
 2   2       438557 non-null  float64
 3   3       438557 non-null  float64
 4   4       438557 non-null  float64
 5   5       438557 non-null  float64
 6   6       438557 non-null  float64
 7   7       438557 non-null  float64
 8   8       438557 non-null  float64
 9   9       438557 non-null  float64
 10  10      438557 non-null  float64
 11  11      438557 non-null  float64
 12  12      438557 non-null  float64
 13  13      438557 non-null  float64
 14  14      438557 non-null  float64
 15  15      438557 non-null  float64
 16  16      438557 non-null  float64
 17  17      438557 non-null  float64
 18  18      438557 non-null  float64
 19  19      438557 non-null  float64
 20  20      438557 non-null  float64
 21  21      438557 non-null  float64
 22  22      438557 non-null  float64
 23  23      438557 non-null  float64
 24  24      438557 non-null  float64
 25  25      438557 non-null  float64
 26  26      438557 non-null  float64
dtypes: float64(27)
memory usage: 90.3 MB

In [74]:
#model training

In [78]:
x=df.drop(columns=['NAME_HOUSING_TYPE'])

AttributeError: 'numpy.ndarray' object has no attribute 'drop'